# １番

In [48]:
import pandas as pd

# ２番

In [49]:
data = "baseball_shop.csv"
df_baseball = pd.read_csv(data)

# ３番

In [50]:
print(df_baseball.shape)
print(df_baseball.info())
display(df_baseball.head())

(376, 5)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 376 entries, 0 to 375
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   ShopID   376 non-null    int64
 1   Pref     376 non-null    object
 2   Product  376 non-null    object
 3   Price    376 non-null    int64
 4   Amount   376 non-null    int64
dtypes: int64(3), object(2)
memory usage: 14.8+ KB
None

   ShopID      Pref  Product  Price  Amount
0      18  Kanagawa      BAT  13800      10
1      18  Kanagawa  UNIFORM  11800      12
2      18  Kanagawa    GLOVE  16700      10
3      18  Kanagawa    SHOES  12800      10
4      30   Ibaraki      BAT  13800       8

# ４番

In [51]:
df_baseball['Pref'].value_counts()

Pref
Kanagawa    68
Tokyo       68
Chiba       64
Ibaraki     48
Saitama     48
Tochigi     40
Gunma       40
Name: count, dtype: int64

# ５番

In [52]:
df_TK = df_baseball[df_baseball['Pref'].isin(['Tokyo', 'Kanagawa'])]
df_TK.head()

   ShopID      Pref  Product  Price  Amount
0      18  Kanagawa      BAT  13800      10
1      18  Kanagawa  UNIFORM  11800      12
2      18  Kanagawa    GLOVE  16700      10
3      18  Kanagawa    SHOES  12800      10
8      73     Tokyo      BAT  13800       8

# ６番

In [53]:
pd.crosstab(df_TK['Pref'], df_TK['Product'], margins=True)

Product   BAT  GLOVE  SHOES  UNIFORM  All
Pref
Kanagawa   17     17     17       17   68
Tokyo      17     17     17       17   68
All        34     34     34       34  136

# ７番

In [54]:
df_TK.groupby('Pref')['Amount'].sum()

Pref
Kanagawa    426
Tokyo       653
Name: Amount, dtype: int64

# ８番

In [55]:
pd.pivot_table(df_TK, values='Price', index='Pref', columns='Product')

Product       BAT    GLOVE    SHOES  UNIFORM
Pref
Kanagawa  13800.0  16700.0  12800.0  11800.0
Tokyo     13800.0  16700.0  12800.0  11800.0